Autodesk.Revit.DB.MultiReferenceAnnotationOptions.ElementsMatchReferenceCategory(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Verifies that all of the elements match the reference category required
by the MultiReferenceAnnotationType.
elements:
The elements to test.
Returns:
True if all the elements match the reference category required by the MultiReferenceAnnotationType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.SetElementsToDimension(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the elements which the dimension will witness.
Remarks:
The dimension will automatically find geometric references in the elements.
elementsToDimension:
The elements which the dimension will witness.
Throws Autodesk.Revit.Exceptions.ArgumentException:
some elements do not match the reference category required by the MultiReferenceAnnotationType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The MultiReferenceAnnotationType assigned to the options can't create MultiReferenceAnnotations by element.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.GetElementsToDimension
Gets the elements which the dimension will witness.
Returns:
The elements which the dimension will witness.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.IsAllowedDimensionStyleType(Autodesk.Revit.DB.DimensionStyleType)
Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations.
dimensionStyleType:
The dimension style type to test.
Returns:
True if the type is allowed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.TagHasLeader
When true the tag will be created with an attached leader.
When false the tag will be created without a leader.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.TagHeadPosition
The position for the tag's head.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionStyleType
The dimension style type to be used by the new MultiReferenceAnnotation.
Remarks:
Only Linear and LinearFixed types are allowed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: dimensionStyleType must be either Linear or LinearFixed to be used by MultiReferenceAnnotations.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionLineOrigin
The origin point for the dimension line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionLineDirection
The direction vector of the dimension line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: dimensionLineDirection is not length 1.0.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.DimensionPlaneNormal
The normal vector to the dimension plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: dimensionPlaneNormal is not length 1.0.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.MultiReferenceAnnotationType
The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.#ctor(Autodesk.Revit.DB.MultiReferenceAnnotationType)
Create an instance of Multi-Reference Annotation Options set with default values.
multiReferenceAnnotationType:
The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions
Options which control the creation of MultiReferenceAnnotations.
Remarks:
MultiReferenceAnnotationOptions include the specification of the associated elements and options for the dimension and tag placement.
Since:
2014